<center> <h1>Universidad Nacional de San Agustín de Arequipa</h1> </center> 
<center> <h1>Escuela Profesional de Ingeniería de Telecomunicaciones</h1> </center> 

<center> <h1> </h1> </center> 

<center><img src="https://user-images.githubusercontent.com/19308295/115939517-f1c6fe80-a463-11eb-989c-812ab4942586.png" width="380" height="4200"></center>

<center> <h2>Ingeniero Renzo Bolivar - Docente DAIE</h2> </center>

<center> <h1>Curso : Programación I</h1> </center>

<center> <h1> GRUPO: 1 </h1> </center>

<center> <h2>INTEGRANTES:</h2> </center> 

<center> <h2>Marin Chiclla, Kevin Nelzon</h2> </center> 

<center> <h2></h2> </center> 

<center> <h2></h2> </center> 

<center> <h2></h2> </center>

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)

![640px-Pandas_logo svg](https://user-images.githubusercontent.com/19308295/119273971-1b925300-bbd3-11eb-9705-fa3a404af0e1.png)

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)

<div style="text-align: center;">
    <h1><font color="#33A5FF">EJERCICIOS</font></h1>
</div>

### Ejercicio 1 - Investigar Como? Abrir archivo `xlsx`

<div class="well">Abrilr el archivo <code>titanic.xlsx</code> (archivo en carpeta /data)
    
   1.- <strong>Usar nueva librería!!.</strong>

   2.- <strong>Explorar la data.</strong>
</div>

<center> <h3>SOLUCIÓN</h3> </center>

**Importamos las librerías básicas**

In [1]:
import numpy as np
import pandas as pd

**Importamos la librería "seaborn" que nos permitirá abrir un archivo Excel**

In [2]:
import seaborn as sns

**Exploramos los archivos Excel en la carpeta Data**

**titanic**

In [3]:
titanic = pd.read_excel('data/titanic.xlsx')

In [4]:
titanic

,Id_Pasajero,Survived,Clase,Nombre,Sexo,Edad,Familiares,Tiquete,Tarifa,Cabina,Embarcado
0,1,0,3,"Braund, Mr. Owen Harris",Masculino,22.0,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Femenino,38.0,0,PC 17599,71.28,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",Femenino,26.0,0,STON/O2. 3101282,7.93,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Femenino,35.0,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",Masculino,35.0,0,373450,8.05,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",Masculino,27.0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",Femenino,19.0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",Femenino,NaN,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",Masculino,26.0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",Masculino,32.0,0,370376,7.75,NaN,Q

**nota**

In [5]:
nota = pd.read_excel('data/nota.xlsx')

In [6]:
nota.head(10)                          #Visualizando solo las 10 primeras filas

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,Alumno,Nota1,Nota2,Nota3,Promedio
1,NaN,NaN,Maria,18,19,18,18.333333
2,NaN,NaN,Jose,8,15,11,11.333333
3,NaN,NaN,Juan,13,12,17,14
4,NaN,NaN,Luis,10,19,18,15.666667
5,NaN,NaN,Carlos,16,12,10,12.666667
6,NaN,NaN,Rosa,7,14,10,10.333333
7,NaN,NaN,Jorge,9,11,19,13
8,NaN,NaN,Victor,6,13,10,9.666667
9,NaN,NaN,Ana,18,19,11,16

### Ejercicio 2 - Investigar Como? Crear SubConjuntos

<div class="well">Crear <strong>Sub Conjuntos</strong> del DataFrame con las columnas: (visualizar solo 5 primeros)
   
   1.-<strong>Nombre</strong> con <strong>Edad</strong>
   
   2.-<strong>Sexo</strong> con <strong>Nombre</strong> y <strong>Clase</strong>
    
</div>

<center> <h3>SOLUCIÓN</h3> </center>

### 1.-Nombre con Edad

In [7]:
import pandas as pd

# Crear DataFrame con los datos proporcionados
data = {
    "Nombre": ["Braund, Mr. Owen Harris", "Cumings, Mrs. John Bradley (Florence Briggs Thayer)", 
               "Heikkinen, Miss. Laina", "Futrelle, Mrs. Jacques Heath (Lily May Peel)", 
               "Allen, Mr. William Henry"],
    "Edad": [22, 38, 26, 35, 35]
}

df = pd.DataFrame(data)

# Crear subconjunto con las columnas "Nombre" y "Edad" y mostrar los primeros 5 registros
subconjunto = df[["Nombre", "Edad"]].head(5)
print(subconjunto)

                                              Nombre  Edad
0                            Braund, Mr. Owen Harris    22
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    38
2                             Heikkinen, Miss. Laina    26
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)    35
4                           Allen, Mr. William Henry    35

### 2.-Sexo con Nombre y Clase

In [8]:
import pandas as pd

# Crear DataFrame con los datos proporcionados
data = {
    "Nombre": ["Braund, Mr. Owen Harris", "Cumings, Mrs. John Bradley (Florence Briggs Thayer)", 
               "Heikkinen, Miss. Laina", "Futrelle, Mrs. Jacques Heath (Lily May Peel)", 
               "Allen, Mr. William Henry"],
    "Sexo": ["Hombre", "Mujer", "Mujer", "Mujer", "Hombre"],
    "Clase": [3, 1, 3, 1, 3]
}

df = pd.DataFrame(data)

# Crear subconjunto con las columnas "Sexo", "Nombre" y "Clase" y mostrar los primeros 5 registros
subconjunto = df[["Sexo", "Nombre", "Clase"]].head(5)
print(subconjunto)

     Sexo                                             Nombre  Clase
0  Hombre                            Braund, Mr. Owen Harris      3
1   Mujer  Cumings, Mrs. John Bradley (Florence Briggs Th...      1
2   Mujer                             Heikkinen, Miss. Laina      3
3   Mujer       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1
4  Hombre                           Allen, Mr. William Henry      3

### Ejercicio 3 - Investigar Como? Filtrar

<div class="well">Crear <strong>Filtros</strong> del DataFrame con: (visualizar solo 5 primeros)
   
   1.-Selección de los <strong>hombres</strong> que abordaron el titanic.
   
   2.-Selección de las <strong>mujeres</strong> que abordaron el titanic.
    
   3.-Personas con <strong>mas de 30 años</strong> que abordaron el titanic.
    
   4.-Personas que <strong>pertenecen a la clase 1 y 2</strong> del titanic.
    
   5.-Personas que <strong>registraron su edad.</strong>
   
    
</div>

<center> <h3>SOLUCIÓN</h3> </center>

In [1]:
import pandas as pd

# Cargar los datos del Titanic desde un archivo Excel (.xlsx)
df = pd.read_excel("data/titanic.xlsx")

# 1. Selección de los hombres que abordaron el Titanic
hombres = df[df['Sexo'] == 'male'].head()
print("Hombres que abordaron el Titanic:")
print(hombres)

# 2. Selección de las mujeres que abordaron el Titanic
mujeres = df[df['Sexo'] == 'female'].head()
print("\nMujeres que abordaron el Titanic:")
print(mujeres)

# 3. Personas con más de 30 años que abordaron el Titanic
mayores_30 = df[df['Edad'] > 30].head()
print("\nPersonas con más de 30 años que abordaron el Titanic:")
print(mayores_30)

# 4. Personas que pertenecen a la clase 1 y 2 del Titanic
clase_1_2 = df[df['Clase'].isin([1, 2])].head()
print("\nPersonas que pertenecen a la clase 1 y 2 del Titanic:")
print(clase_1_2)

# 5. Personas que registraron su edad
con_edad = df[df['Edad'].notnull()].head()
print("\nPersonas que registraron su edad:")
print(con_edad)

Hombres que abordaron el Titanic:
Empty DataFrame
Columns: [Id_Pasajero, Survived, Clase, Nombre, Sexo, Edad, Familiares, Tiquete, Tarifa, Cabina, Embarcado]
Index: []

Mujeres que abordaron el Titanic:
Empty DataFrame
Columns: [Id_Pasajero, Survived, Clase, Nombre, Sexo, Edad, Familiares, Tiquete, Tarifa, Cabina, Embarcado]
Index: []

Personas con más de 30 años que abordaron el Titanic:
    Id_Pasajero  Survived  Clase  \
1             2         1      1
3             4         1      1
4             5         0      3
6             7         0      1
11           12         1      1

                                               Nombre       Sexo  Edad  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...   Femenino  38.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)   Femenino  35.0
4                            Allen, Mr. William Henry  Masculino  35.0
6                             McCarthy, Mr. Timothy J  Masculino  54.0
11                           Bonnell, Miss. Elizabeth   Femenino  58.0

    Familiares   Tiquete  Tarifa Cabina Embarcado
1            0  PC 17599   71.28    C85         C
3            0    113803   53.10   C123         S
4            0    373450    8.05    NaN         S
6            0     17463   51.86    E46         S
11           0    113783   26.55   C103         S

Personas que pertenecen a la clase 1 y 2 del Titanic:
    Id_Pasajero  Survived  Clase  \
1             2         1      1
3             4         1      1
6             7         0      1
9            10         1      2
11           12         1      1

                                               Nombre       Sexo  Edad  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...   Femenino  38.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)   Femenino  35.0
6                             McCarthy, Mr. Timothy J  Masculino  54.0
9                 Nasser, Mrs. Nicholas (Adele Achem)   Femenino  14.0
11                           Bonnell, Miss. Elizabeth   Femenino  58.0

    Familiares   Tiquete  Tarifa Cabina Embarcado
1            0  PC 17599   71.28    C85         C
3            0    113803   53.10   C123         S
6            0     17463   51.86    E46         S
9            0    237736   30.07    NaN         C
11           0    113783   26.55   C103         S

Personas que registraron su edad:
   Id_Pasajero  Survived  Clase  \
0            1         0      3
1            2         1      1
2            3         1      3
3            4         1      1
4            5         0      3

                                              Nombre       Sexo  Edad  \
0                            Braund, Mr. Owen Harris  Masculino  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...   Femenino  38.0
2                             Heikkinen, Miss. Laina   Femenino  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Femenino  35.0
4                           Allen, Mr. William Henry  Masculino  35.0

   Familiares           Tiquete  Tarifa Cabina Embarcado
0           0         A/5 21171    7.25    NaN         S
1           0          PC 17599   71.28    C85         C
2           0  STON/O2. 3101282    7.93    NaN         S
3           0            113803   53.10   C123         S
4           0            373450    8.05    NaN         S

### Ejercicio 4 - Investigar Como?  Seleccionar Filas y Columnas

<div class="well">Crear <strong>Selección</strong> del DataFrame con: 
   
   1.-Selección de los <strong>nombres</strong> de pasajeros <strong>mayores de 30 años.</strong>
   
   2.-Selección de los <strong>nombres</strong> de las <strong>mujeres</strong> que tienen familiares que abordaron el titanic.
    
   3.-Selección de las <strong>filas 0 a 10 y las columnas 2 a 6.</strong>
    
   
</div>

<center> <h3>SOLUCIÓN</h3> </center>

In [ ]:
#1.-Selección de los nombres de pasajeros mayores de 30 años.
import pandas as pd
xlsx="data/titanic.xlsx"
df=pd.read_excel(xlsx)
print(df)

In [ ]:
import pandas as pd
xlsx="data/titanic.xlsx"
df=pd.read_excel(xlsx)
df=df[df["Edad"]>30]
losquecumplen=df["Edad"]
print(losquecumplen)

In [ ]:
#2.-Selección de los nombres de las mujeres que tienen familiares que abordaron el titanic.
import pandas as pd

# Set the path to the XLSX file
xlsx_file_path = "data/titanic.xlsx"

# Read the XLSX file into a Pandas DataFrame
df = pd.read_excel(xlsx_file_path)

# Filter the DataFrame by age and location
df = df[(df["Sexo"] == 'Femenino') & (df["Familiares"] >0)]

# Print the DataFrame
print(df)

In [ ]:
#3.-Selección de las filas 0 a 10 y las columnas 2 a 6.
import pandas as pd

# Read the Excel file
df = pd.read_excel("data/titanic.xlsx")

# Select rows 0 to 10
df = df.iloc[0:10]

# Select columns 2 to 6
df = df.iloc[:, 2:6]

# Print the selected data
print(df)

### Ejercicio 5 - Investigar Como?

<div class="well">Hallar los <strong>Valores</strong> del DataFrame: 
   
   1.-<strong>Valor promedio</strong> de la edad de los pasajeros.
   
   2.-Pasajeros <strong>mujeres</strong> con <strong>mayor edad</strong> que abordaron el titanic.
    
   3.-Pasajeros <strong>mujeres</strong> con <strong>menor edad</strong> que abordaron el titanic.
    
   4.-Número <strong>total de pasajeros</strong> registrados en el titanic
    
   
</div>

<center> <h3>SOLUCIÓN</h3> </center>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.read_csv("data/titanic_comma.csv")

In [ ]:
edad = data["Age"]
print("1) La edad promedio es:", edad.mean())

In [ ]:
mujeres = data[data["Sex"]=="female"]
mujeres_1 = mujeres.sort_values(by="Age")
mujeres_2 = mujeres_1[mujeres_1["Age"].notna()]

In [ ]:
print("2) Las mujeres con mayor edad: ")
mujeres_2.tail(10)

In [ ]:
print("3) Las mujeres con menor edad: ")
mujeres_2.head(10)

In [ ]:
data.shape

In [ ]:
print("4) Se registraron 1313 pasajeros en el Titanic")

![linea 2](https://user-images.githubusercontent.com/19308295/115926262-2fb62980-a448-11eb-8189-c2f10e499944.png)

<div style="text-align: center;">
    <h1><font color="#33A5FF">BIBLIOGRAFÍA</font></h1>
</div>

[1] Guía de pandas oficial: https://pandas.pydata.org/docs/user_guide/index.html

[2] Python Pandas Tutorial: A Complete Introduction for Beginners https://bit.ly/2AQMQld

[3] Guía para pandas: https://pybonacci.org/2014/05/30/pandas-i/

[4] Dataset variados: https://www.kaggle.com/datasets

[5] Probabilidad y estadística (introductorio a medio) Diez, D., Barr, C., Çetinkaya-Rundel, M. (2015). OpenIntro Statistics, segunda edición. OpenIntro. https://www.openintro.org/stat/textbook.php?stat_book=os

[6] Probabilidad y estadística (medio a avanzado) Navarro, D. (2015). Learning statistics with R: A tutorial for psychology students and other beginners. University of Adelaide. http://www.fon.hum.uva.nl/paul/lot2015/Navarro2014.pdf

[7] R aplicado a Data Science Peng, R. D. (2016). R Programming for Data Science. Leanpub. https://leanpub.com/rprogramming

[8] Programación con R (avanzado) Wickham. H. y Grolemund, G. (2017). R for Data Science. O’Reilly. http://r4ds.had.co.nz/ 

[9] Wickham, H. (2014). Tidy Data. Journal of Statistical Software. https://www.jstatsoft.org/article/view/v059i10/v59i10.pdf 

[10] Wickham, H. (2014). Advanced R. O’Reilly. http://adv-r.had.co.nz/


[11] Referencias sobre RStudio RStudio Cheat Sheets. https://www.rstudio.com/resources/cheatsheets/

[12] Seaborn https://seaborn.pydata.org/#

![linea 1](https://user-images.githubusercontent.com/19308295/115926252-2b8a0c00-a448-11eb-9d9c-b43beaf0ff68.png)